https://towardsdatascience.com/mastering-a-function-in-10-steps-pandas-groupby-54a438e9ea93

In [1]:
import pandas as pd
df = pd.DataFrame({
   "names": ["John", "Jane", "Ashley", "Allen", "Betty"],
   "gender": ["Male", "Female", "Female", "Male", "Female"],
   "height": [182, 176, 174, 178, 172],
   "education": ["BS", "BS", "BA", "BA", "BS"],
   "salary": [65000, 72000, 74000, 68000, 80000]
})
df

    names  gender  height education  salary
0    John    Male     182        BS   65000
1    Jane  Female     176        BS   72000
2  Ashley  Female     174        BA   74000
3   Allen    Male     178        BA   68000
4   Betty  Female     172        BS   80000

In [2]:
df.groupby("gender").mean()

        height        salary
gender
Female   174.0  75333.333333
Male     180.0  66500.000000

In [3]:
df[["gender","salary"]].groupby("gender").mean()

              salary
gender
Female  75333.333333
Male    66500.000000

In [4]:
df.groupby("gender").agg(
   avg_salary = pd.NamedAgg("salary","mean")
)

          avg_salary
gender
Female  75333.333333
Male    66500.000000

In [5]:
df.groupby("gender").agg(avg_salary=("salary","mean"))

          avg_salary
gender
Female  75333.333333
Male    66500.000000

In [6]:
df.groupby("gender").agg(
   median_salary=("salary","median"),
   avg_height=("height","mean")
)

        median_salary  avg_height
gender
Female          74000         174
Male            66500         180

In [7]:
df.groupby("gender", as_index=False).agg(
   median_salary=("salary","median"),
   avg_height=("height","mean")
)

   gender  median_salary  avg_height
0  Female          74000         174
1    Male          66500         180

In [8]:
df.groupby(["gender","education"], as_index=False).agg(
   median_salary=("salary","median"),
   avg_height=("height","mean")
)

   gender education  median_salary  avg_height
0  Female        BA          74000         174
1  Female        BS          76000         174
2    Male        BA          68000         178
3    Male        BS          65000         182

In [9]:
df.groupby(["gender","education"], as_index=False).agg(
   median_salary=("salary","median"),
   avg_height=("height","mean")
).sort_values(by="median_salary", ascending=False)

   gender education  median_salary  avg_height
1  Female        BS          76000         174
0  Female        BA          74000         174
2    Male        BA          68000         178
3    Male        BS          65000         182

In [10]:
df.iloc[4,1] = None
df

    names  gender  height education  salary
0    John    Male     182        BS   65000
1    Jane  Female     176        BS   72000
2  Ashley  Female     174        BA   74000
3   Allen    Male     178        BA   68000
4   Betty    None     172        BS   80000

In [11]:
df.groupby("gender").agg(avg_salary=("salary","mean"))

        avg_salary
gender
Female       73000
Male         66500